#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
azurerm_resource_group.network: Refreshing state... [id=/subscriptions/e286703f-8ba4-4a0d-bd44-8fb115bdebcd/resourceGroups/sjb-rg-uks-network]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_resource_group.network has been deleted
  - resource "azurerm_resource_group" "network" {
        id         = "/subscriptions/e286703f-8ba4-4a0d-bd44-8fb115bdebcd/resourceGroups/sjb-rg-uks-network"
      - location   = "uksouth" -> null
      - name       = "sjb-rg-uks-network" -> null
        # (1 unchanged attribute hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.network will be created
  + resource "azurerm_resource_group" "network" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "sjb-rg-uks-network"
    }

  # azurerm_virtual_network.vnet01 will be created
  + resource "azurerm_virtual_network" "vnet01" {
      + address_space                  = [
          + "10.0.8.0/21",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "uksouth"
      + name                           = "sjb-uks-vnet-01"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "sjb-rg-uks-network"
      + subnet                         = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @sporticia, Action: `pull_request`*